tap "buildpacks/tap"
tap "git-time-metric/gtm"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "iandol/adobe-fonts"

tap "dotenvx/brew"
tap "homebrew/services"
# tap "jesseduffield/lazydocker"
# tap "jesseduffield/lazygit"
# tap "mutagen-io/mutagen/mutagen"

if OS.mac?

    # brew "cocoapods"

    brew "trash"
    brew "coreutils"
    brew "curl"
    brew "git"

    # Applications

    # don't brew "atext" get legacy https://www.trankynam.com/atext/legacy
    cask "alfred"
    cask "bartender"
    cask "choosy"
    cask "chromium"
    cask "cleanshot"
    cask "colorsnapper"
    cask "dbeaver-community"
    cask "docker"
    cask "dropshare"
    # cask "figma" #something wrong with the brew version?
    cask "firefox"
    cask "grandperspective"
    # cask "hermes" #only for Pandora Music
    cask "imageoptim"
    # cask "istat-menus" #cdn is blocked by zscaler?
    cask "iterm2"
    cask "karabiner-elements"
    cask "logseq"
    cask "loop"
    cask "loopback"
    # cask "vanilla" #instead of bartender?
    cask "visual-studio-code"
    cask "vlc"
    cask "figma"
    cask "ticktick"
    cask "slack"
    cask "tripmode"
    cask "visual-studio-code"
    cask "vlc"
    cask "xbar"
    cask "zoom"

    # Fonts

    cask "font-fira-code"
    cask "font-source-code-pro"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-meslo-for-powerline"
    cask "font-3270-nerd-font"
    cask "font-geist-mono"
    cask "font-sauce-code-pro-nerd-font"

    # # macOS App Store
    # brew "mas"
    # mas "Affinity Designer", id: 824171161

    # mas "Airmail", id: 918858936

    # mas "Xcode", id: 497799835

    # mas "Magnet", id: 441258766

    ## Qicklooks

    # cask "quicklook-json"
    # cask "qlmarkdown"
end

# brew "contentful-cli"
# brew "heroku/brew/heroku"
# brew "loc" #replaced with scc
# brew "mutagen"
# brew "python"
# brew "rbenv"
# cask "meld"
# cask "sublime-text"
cask "logseq"
brew "asimov"
brew "atuin"
brew "lsd"
brew "nnn"
brew "awscli"
brew "buildpacks/tap/pack"
brew "direnv"
brew "expect"
brew "ffmpeg"
brew "flow"
brew "gh"
brew "git-lfs"
brew "git-time-metric/gtm/gtm"
brew "glab"
brew "gnu-tar"
brew "go"
brew "gpg"
brew "glib"
brew "dotenvx"
brew "cffi", link: false
brew "cmake"
brew "cryptography", link: false
brew "go-jira"
brew "graphicsmagick"
brew "graphviz"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "libdvdcss"
brew "mackup"
brew "magic-wormhole"
brew "pandoc"
brew "pipx"
# brew "pnpm"
brew "pow"
brew "python-setuptools"
brew "python@3"
brew "ripgrep"
brew "sqlite"
brew "task"
brew "taskwarrior-tui"
brew "terminal-notifier"
brew "terraform"
brew "tidy-html5"
brew "timewarrior"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "watch"
brew "watchman"
brew "yarn"
brew "xz"
brew "zellij"

